Revit 2027 API
ExportIFCCategoryInfo Methods
The ExportIFCCategoryInfo type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsDefault |  Determines if a ExportIFCCategoryInfo contains default information.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ExportIFCCategoryInfo Class
Autodesk.Revit.DB Namespace